Config/Documents/РегистрацияГрафиковИсполненияДоговоров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>РегистрацияГрафиковИсполненияДоговоров</Name>
			<BasedOn>
				<xr:Item>Catalog.Договоры</xr:Item>
				<xr:Item>Document.РегистрацияГрафиковИсполненияДоговоров</xr:Item>
				<xr:Item>Document.СчетНаОплату</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ИсполнениеДоговоровСПокупателями</xr:Item>
				<xr:Item>AccumulationRegister.ОплатаОтПокупателейДебиторов</xr:Item>
				<xr:Item>AccumulationRegister.ОплатаПоставщикамКредиторам</xr:Item>
				<xr:Item>AccumulationRegister.ИсполнениеОбязательствПоставщиками</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсправлениеОшибокПрошлыхЛет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ГрафикПлатежей</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗапретИзменения</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИФО</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КФО</Name>
							<Comment>Код вида деятельности</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.КВД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КПС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификационныеПризнакиСчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КЭК</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КОСГУ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетРасчетов</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.ЕПСБУ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДопКлассификация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДополнительнаяБюджетнаяКлассификация</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодМероприятия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Мероприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодЦели</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыЦелевыхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВВалюте</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВВалютеДоИзменений</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВВалютеПослеИзменений</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОплатитьДо</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидРасчетов</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыРасчетовПоЗаймам</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ГрафикИсполнения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗапретИзменения</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИФО</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КФО</Name>
							<Comment>Код вида деятельности</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.КВД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КПС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификационныеПризнакиСчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КЭК</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КОСГУ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетРасчетов</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.ЕПСБУ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВВалюте</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВВалютеДоИзменений</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВВалютеПослеИзменений</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИсполнитьДо</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/Enums/ВидыДоговоровКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыДоговоровКонтрагентов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СПоставщиком</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СПокупателем</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоглашениеОСубсидии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СОтправителемТрансферта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПредоставленныйКредит</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолученныйКредит</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПредоставленнаяГарантия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыпускЦенныхБумаг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИноеОбязательство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомитентом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомитентомНаЗакупку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомиссионером</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомиссионеромНаЗакупку</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Enums/ВидыРасчетовПоЗаймам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыРасчетовПоЗаймам</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОсновнойДолг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Проценты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Штрафы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПениНаОсновнойДолг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПениНаПроценты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтоимостьРазмещенияЦБ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтклонениеОтНоминала</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Documents/РегистрацияГрафиковИсполненияДоговоров/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// Определяет список команд заполнения.
//
// Параметры:
//   КомандыЗаполнения - ТаблицаЗначений - Таблица с командами заполнения. Для изменения.
//       См. описание 1 параметра процедуры ЗаполнениеОбъектовПереопределяемый.ПередДобавлениемКомандЗаполнения().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры ЗаполнениеОбъектовПереопределяемый.ПередДобавлениемКомандЗаполнения().
//
Процедура ДобавитьКомандыЗаполнения(КомандыЗаполнения, Параметры) Экспорт
	
КонецПроцедуры	

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// Создает элементы справочника ДокументыБИА для выгрузки информации в 1С:Архив.
// 
// Параметры:
//  СсылкаНаОбъектИсточник - ОпределяемыйТип.СсылкаНаОбъектИсточникБИА - ссылка на объект,
//   который нужно передать в 1С:Архив.
//
// Возвращаемое значение:
//  Массив из ДокументОбъект.ДокументыБИА - созданные документы.
//
Функция СоздатьДокументыБИА(СсылкаНаОбъектИсточник) Экспорт
	СформированныеДокументыБИА = Новый Массив;
	
	ОбменСАрхивомБГУ.СоздатьДокументыБИАДляДокументаУчета(СсылкаНаОбъектИсточник, СформированныеДокументыБИА);
	
	Возврат СформированныеДокументыБИА;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПроведениеДокумента

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства) Экспорт
	
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументСсылка,
		"Организация,Дата,Договор,ИсправлениеОшибокПрошлыхЛет");
	РеквизитыДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЗначенияРеквизитов.Договор,
		"ВидДоговора,ВестиГрафикПлатежей,ВестиПланГрафикИсполнения");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.УстановитьПараметр("ПустаяДата", '00010101');
	
	ТаблицыЗапроса = Новый Массив;
	
	Если РеквизитыДоговора.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком
		ИЛИ РеквизитыДоговора.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ПолученныйКредит
		ИЛИ РеквизитыДоговора.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВыпускЦенныхБумаг
		ИЛИ РеквизитыДоговора.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СоглашениеОСубсидии Тогда
		
		ТаблицыЗапроса.Добавить("ОплатаПоставщикамКредиторам");
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|	ВЫБОР
		|		КОГДА ГрафикПлатежей.ОплатитьДо = &ПустаяДата
		|			ТОГДА ГрафикПлатежей.Ссылка.Дата
		|		ИНАЧЕ ГрафикПлатежей.ОплатитьДо
		|	КОНЕЦ КАК Период,
		|	ГрафикПлатежей.ВидРасчетов КАК ВидРасчетов,
		|	ГрафикПлатежей.ИФО КАК ИФО,
		|	ГрафикПлатежей.КФО КАК КФО,
		|	ГрафикПлатежей.КПС КАК КПС,
		|	ГрафикПлатежей.КЭК КАК КЭК,
		|	ГрафикПлатежей.СчетРасчетов КАК СчетРасчетов,
		|	ГрафикПлатежей.ДопКлассификация КАК ДопКлассификация,
		|	ГрафикПлатежей.КодМероприятия КАК КодМероприятия,
		|	ГрафикПлатежей.КодЦели КАК КодЦели,
		|	ГрафикПлатежей.Ссылка.Организация КАК Организация,
		|	ГрафикПлатежей.Ссылка.Контрагент КАК Контрагент,
		|	ГрафикПлатежей.Ссылка.Договор КАК Договор,
		|	ГрафикПлатежей.Ссылка.ВалютаДокумента КАК Валюта,
		|	ГрафикПлатежей.ОплатитьДо КАК ОплатитьДо,
		|	ГрафикПлатежей.СуммаВВалюте КАК Сумма
		|ИЗ
		|	Документ.РегистрацияГрафиковИсполненияДоговоров.ГрафикПлатежей КАК ГрафикПлатежей
		|ГДЕ
		|	ГрафикПлатежей.Ссылка = &Ссылка
		|	И ГрафикПлатежей.СуммаВВалюте <> 0";
		
	ИначеЕсли РеквизитыДоговора.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем
		ИЛИ РеквизитыДоговора.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СОтправителемТрансферта
		ИЛИ РеквизитыДоговора.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ПредоставленныйКредит Тогда
		
		ТаблицыЗапроса.Добавить("ОплатаОтПокупателейДебиторов");
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|	ВЫБОР
		|		КОГДА ГрафикПлатежей.ОплатитьДо = &ПустаяДата
		|			ТОГДА ГрафикПлатежей.Ссылка.Дата
		|		ИНАЧЕ ГрафикПлатежей.ОплатитьДо
		|	КОНЕЦ КАК Период,
		|	ГрафикПлатежей.ВидРасчетов КАК ВидРасчетов,
		|	ГрафикПлатежей.ИФО КАК ИФО,
		|	ГрафикПлатежей.КФО КАК КФО,
		|	ГрафикПлатежей.КПС КАК КПС,
		|	ГрафикПлатежей.КЭК КАК КЭК,
		|	ГрафикПлатежей.СчетРасчетов КАК СчетРасчетов,
		|	ГрафикПлатежей.ДопКлассификация КАК ДопКлассификация,
		|	ГрафикПлатежей.КодМероприятия КАК КодМероприятия,
		|	ГрафикПлатежей.КодЦели КАК КодЦели,
		|	ГрафикПлатежей.Ссылка.Организация КАК Организация,
		|	ГрафикПлатежей.Ссылка.Контрагент КАК Контрагент,
		|	ГрафикПлатежей.Ссылка.Договор КАК Договор,
		|	ГрафикПлатежей.Ссылка.ВалютаДокумента КАК Валюта,
		|	ГрафикПлатежей.ОплатитьДо КАК ОплатитьДо,
		|	ГрафикПлатежей.СуммаВВалюте КАК Сумма
		|ИЗ
		|	Документ.РегистрацияГрафиковИсполненияДоговоров.ГрафикПлатежей КАК ГрафикПлатежей
		|ГДЕ
		|	ГрафикПлатежей.Ссылка = &Ссылка
		|	И ГрафикПлатежей.СуммаВВалюте <> 0";
		
	КонецЕсли;
	
	Если РеквизитыДоговора.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком
		ИЛИ РеквизитыДоговора.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СоглашениеОСубсидии Тогда
		
		ТаблицыЗапроса.Добавить("ИсполнениеОбязательствПоставщиками");
		Запрос.Текст = ?(ПустаяСтрока(Запрос.Текст), "", Запрос.Текст + ОбщегоНазначения.РазделительПакетаЗапросов()) +
		"ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|	ВЫБОР
		|		КОГДА ГрафикИсполнения.ИсполнитьДо = &ПустаяДата
		|			ТОГДА ГрафикИсполнения.Ссылка.Дата
		|		ИНАЧЕ ГрафикИсполнения.ИсполнитьДо
		|	КОНЕЦ КАК Период,
		|	ГрафикИсполнения.ИФО КАК ИФО,
		|	ГрафикИсполнения.КФО КАК КФО,
		|	ГрафикИсполнения.КПС КАК КПС,
		|	ГрафикИсполнения.КЭК КАК КЭК,
		|	ГрафикИсполнения.СчетРасчетов КАК СчетРасчетов,
		|	ГрафикИсполнения.Ссылка.Организация КАК Организация,
		|	ГрафикИсполнения.Ссылка.Контрагент КАК Контрагент,
		|	ГрафикИсполнения.Ссылка.Договор КАК Договор,
		|	ГрафикИсполнения.Ссылка.ВалютаДокумента КАК Валюта,
		|	ГрафикИсполнения.ИсполнитьДо КАК ИсполнитьДо,
		|	ГрафикИсполнения.СуммаВВалюте КАК Сумма
		|ИЗ
		|	Документ.РегистрацияГрафиковИсполненияДоговоров.ГрафикИсполнения КАК ГрафикИсполнения
		|ГДЕ
		|	ГрафикИсполнения.Ссылка = &Ссылка
		|	И ГрафикИсполнения.СуммаВВалюте <> 0";
		
	ИначеЕсли РеквизитыДоговора.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем
		ИЛИ РеквизитыДоговора.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СОтправителемТрансферта Тогда
		
		ТаблицыЗапроса.Добавить("ИсполнениеДоговоровСПокупателями");
		Запрос.Текст = ?(ПустаяСтрока(Запрос.Текст), "", Запрос.Текст + ОбщегоНазначения.РазделительПакетаЗапросов()) +
		"ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|	ВЫБОР
		|		КОГДА ГрафикИсполнения.ИсполнитьДо = &ПустаяДата
		|			ТОГДА ГрафикИсполнения.Ссылка.Дата
		|		ИНАЧЕ ГрафикИсполнения.ИсполнитьДо
		|	КОНЕЦ КАК Период,
		|	ГрафикИсполнения.ИФО КАК ИФО,
		|	ГрафикИсполнения.КФО КАК КФО,
		|	ГрафикИсполнения.КПС КАК КПС,
		|	ГрафикИсполнения.КЭК КАК КЭК,
		|	ГрафикИсполнения.СчетРасчетов КАК СчетРасчетов,
		|	ГрафикИсполнения.Ссылка.Организация КАК Организация,
		|	ГрафикИсполнения.Ссылка.Контрагент КАК Контрагент,
		|	ГрафикИсполнения.Ссылка.Договор КАК Договор,
		|	ГрафикИсполнения.Ссылка.ВалютаДокумента КАК Валюта,
		|	ГрафикИсполнения.ИсполнитьДо КАК ИсполнитьДо,
		|	ГрафикИсполнения.СуммаВВалюте КАК Сумма
		|ИЗ
		|	Документ.РегистрацияГрафиковИсполненияДоговоров.ГрафикИсполнения КАК ГрафикИсполнения
		|ГДЕ
		|	ГрафикИсполнения.Ссылка = &Ссылка
		|	И ГрафикИсполнения.СуммаВВалюте <> 0";
		
	КонецЕсли;
	
	Результат = Запрос.ВыполнитьПакет();
	
	ТаблицыДляДвижений = ДополнительныеСвойства.ТаблицыДляДвижений;
	ОбщегоНазначенияБГУ.ВыгрузитьТаблицыЗапроса(ТаблицыДляДвижений, Результат, ТаблицыЗапроса);
	
	Если ЗначенияРеквизитов.ИсправлениеОшибокПрошлыхЛет Тогда
		КонтрольИсполненияДоговоров.УстановитьПризнакИсправлениеОшибокПрошлыхЛетВДвиженияхПоРегистру(ТаблицыДляДвижений, "ОплатаОтПокупателейДебиторов");
		КонтрольИсполненияДоговоров.УстановитьПризнакИсправлениеОшибокПрошлыхЛетВДвиженияхПоРегистру(ТаблицыДляДвижений, "ОплатаПоставщикамКредиторам");
		КонтрольИсполненияДоговоров.УстановитьПризнакИсправлениеОшибокПрошлыхЛетВДвиженияхПоРегистру(ТаблицыДляДвижений, "ИсполнениеДоговоровСПокупателями");
		КонтрольИсполненияДоговоров.УстановитьПризнакИсправлениеОшибокПрошлыхЛетВДвиженияхПоРегистру(ТаблицыДляДвижений, "ИсполнениеОбязательствПоставщиками");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ЗаполнениеДокумента

Процедура ЗаполнитьГрафикПлатежейПоПараметрам(ДокументОбъект, ПараметрыГрафиков, ДопустимыеСчета) Экспорт
	
	ДокументОбъект.ГрафикПлатежей.Очистить();
	
	МетаданныеДокумента = ДокументОбъект.Ссылка.Метаданные();
	ИФОвТабЧасти = ОбщегоНазначенияБГУ.ЕстьРеквизитТабЧастиДокумента("ИФО", МетаданныеДокумента, "ГрафикПлатежей");
	
	ГрафикПлатежейИсходный = ДокументОбъект.ГрафикПлатежей.Выгрузить();
	ГрафикПлатежейНовый = ГрафикПлатежейИсходный.СкопироватьКолонки();
	ГрафикПлатежейНовый.Колонки.Добавить("БазаРаспределения", Новый ОписаниеТипов("Число"));
	
	ПараметрыПериода = УчетДоходовРасходов.ПараметрыПризнанияДоходовРасходовПоМесяцам(ПараметрыГрафиков.НачалоПериодаПлатежей, ПараметрыГрафиков.КонецПериодаПлатежей);
	ПлатежиВКонцеПериода = (ПараметрыГрафиков.ВариантПлатежей = 0);
	
	// Инициализация переменных цикла.
	Если ПараметрыГрафиков.ПериодичностьПлатежей = "ПоМесяцам" Тогда // Начало месяца.
		ОчереднойМесяц = НачалоМесяца(ПараметрыГрафиков.НачалоПериодаПлатежей);
	ИначеЕсли ПараметрыГрафиков.ПериодичностьПлатежей = "ПоКварталам" Тогда // Начало квартала.
		ОчереднойМесяц = НачалоКвартала(ПараметрыГрафиков.НачалоПериодаПлатежей);
	ИначеЕсли ПараметрыГрафиков.ПериодичностьПлатежей = "ПоПолугодиям" Тогда // Начало полугодия.
		ОчереднойМесяц = ?(Месяц(ПараметрыГрафиков.НачалоПериодаПлатежей) <= 6, НачалоГода(ПараметрыГрафиков.НачалоПериодаПлатежей),
			Дата(Год(ПараметрыГрафиков.НачалоПериодаПлатежей), 7, 1) );
	ИначеЕсли ПараметрыГрафиков.ПериодичностьПлатежей = "ПоГодам" Тогда // Начало года.
		ОчереднойМесяц = НачалоГода(ПараметрыГрафиков.НачалоПериодаПлатежей);
	Иначе // Раз в месяц, в 3 месяца, в 6 месяцев, в 12 месяцев.
		ОчереднойМесяц = НачалоДня(ПараметрыГрафиков.НачалоПериодаПлатежей);
	КонецЕсли;
	СчетчикПоКварталам = 0;
	СчетчикПоПолугодиям = 0;
	СчетчикПоГодам = 0;
	
	// Цикл по месяцам.
	Пока КонецДня(ОчереднойМесяц) <= КонецДня(ПараметрыГрафиков.КонецПериодаПлатежей) Цикл
		
		ДоляМесяца = 0;
		Если ПараметрыГрафиков.ПериодичностьПлатежей = "ПоМесяцам"
		 ИЛИ ПараметрыГрафиков.ПериодичностьПлатежей = "ПоКварталам"
		 ИЛИ ПараметрыГрафиков.ПериодичностьПлатежей = "ПоПолугодиям"
		 ИЛИ ПараметрыГрафиков.ПериодичностьПлатежей = "ПоГодам" Тогда
			
			НачалоПериода = Макс(ПараметрыГрафиков.НачалоПериодаПлатежей, НачалоДня(ОчереднойМесяц));
			КонецПериода = Мин(ПараметрыГрафиков.КонецПериодаПлатежей,  НачалоДня(КонецМесяца(ОчереднойМесяц)));
			
			Если КонецПериода < НачалоПериода Тогда
				ДоляМесяца = 0; // Месяц за пределами выбранного периода.
			ИначеЕсли НачалоПериода >= ПараметрыПериода.НачалоПериодаЦелыхМесяцев
				И КонецПериода <= ПараметрыПериода.КонецПериодаЦелыхМесяцев Тогда // Внутри периода целых месяцев.
				ДоляМесяца = 1; // Целый месяц.
			Иначе
				НецелыйМесяц = ПараметрыПериода.НецелыеМесяцы.Найти(НачалоМесяца(ОчереднойМесяц), "Месяц");
				Если НецелыйМесяц = Неопределено Тогда
					ДоляМесяца = 1; // Целый месяц.
				Иначе
					ДоляМесяца = НецелыйМесяц.Вес; // Нецелый месяц.
				КонецЕсли;
			КонецЕсли;
			
		Иначе
			
			НачалоПериода = Макс(ПараметрыГрафиков.НачалоПериодаПлатежей, НачалоДня(ОчереднойМесяц));
			КонецПериода = Мин(ПараметрыГрафиков.КонецПериодаПлатежей,  ДобавитьМесяц(ОчереднойМесяц, 1));
			ДоляМесяца = 1;
			
		КонецЕсли;
		
		Если ПараметрыГрафиков.ПериодичностьПлатежей = "ПоМесяцам"
		 ИЛИ ПараметрыГрафиков.ПериодичностьПлатежей = "РазВ1Месяц" Тогда
			
			НоваяСтрока = ГрафикПлатежейНовый.Добавить();
			НоваяСтрока.БазаРаспределения = ДоляМесяца;
			НоваяСтрока.ОплатитьДо = ?(ПлатежиВКонцеПериода, КонецПериода, НачалоПериода);
			
		ИначеЕсли ПараметрыГрафиков.ПериодичностьПлатежей = "ПоКварталам"
			ИЛИ   ПараметрыГрафиков.ПериодичностьПлатежей = "РазВ3Месяца" Тогда
			
			СчетчикПоКварталам = СчетчикПоКварталам + 1;
			Если СчетчикПоКварталам > 3 Тогда
				СчетчикПоКварталам = 1; // Новый квартал.
			КонецЕсли;
			
			Если СчетчикПоКварталам = 1 Тогда
				НоваяСтрока = ГрафикПлатежейНовый.Добавить();
				НоваяСтрока.БазаРаспределения = ДоляМесяца;
			Иначе
				НоваяСтрока.БазаРаспределения = НоваяСтрока.БазаРаспределения + ДоляМесяца;
			КонецЕсли;
			
			Если Не ПлатежиВКонцеПериода И СчетчикПоКварталам = 1 Тогда
				НоваяСтрока.ОплатитьДо = НачалоПериода;
			ИначеЕсли ПлатежиВКонцеПериода Тогда
				НоваяСтрока.ОплатитьДо = КонецПериода;
			КонецЕсли;
			
		ИначеЕсли ПараметрыГрафиков.ПериодичностьПлатежей = "ПоПолугодиям"
			ИЛИ   ПараметрыГрафиков.ПериодичностьПлатежей = "РазВ6Месяцев" Тогда
			
			СчетчикПоПолугодиям = СчетчикПоПолугодиям + 1;
			Если СчетчикПоПолугодиям > 6 Тогда
				СчетчикПоПолугодиям = 1; // Новое полугодие.
			КонецЕсли;
			
			Если СчетчикПоПолугодиям = 1 Тогда
				НоваяСтрока = ГрафикПлатежейНовый.Добавить();
				НоваяСтрока.БазаРаспределения = ДоляМесяца;
			Иначе
				НоваяСтрока.БазаРаспределения = НоваяСтрока.БазаРаспределения + ДоляМесяца;
			КонецЕсли;
			
			Если Не ПлатежиВКонцеПериода И СчетчикПоПолугодиям = 1 Тогда
				НоваяСтрока.ОплатитьДо = НачалоПериода;
			ИначеЕсли ПлатежиВКонцеПериода Тогда
				НоваяСтрока.ОплатитьДо = КонецПериода;
			КонецЕсли;
			
		ИначеЕсли ПараметрыГрафиков.ПериодичностьПлатежей = "ПоГодам"
			ИЛИ   ПараметрыГрафиков.ПериодичностьПлатежей = "РазВ12Месяцев" Тогда
			
			СчетчикПоГодам = СчетчикПоГодам + 1;
			Если СчетчикПоГодам > 12 Тогда
				СчетчикПоГодам = 1; // Новый год.
			КонецЕсли;
			
			Если СчетчикПоГодам = 1 Тогда
				НоваяСтрока = ГрафикПлатежейНовый.Добавить();
				НоваяСтрока.БазаРаспределения = ДоляМесяца;
			Иначе
				НоваяСтрока.БазаРаспределения = НоваяСтрока.БазаРаспределения + ДоляМесяца;
			КонецЕсли;
			
			Если Не ПлатежиВКонцеПериода И СчетчикПоГодам = 1 Тогда
				НоваяСтрока.ОплатитьДо = НачалоПериода;
			ИначеЕсли ПлатежиВКонцеПериода Тогда
				НоваяСтрока.ОплатитьДо = КонецПериода;
			КонецЕсли;
			
		КонецЕсли;
		
		НоваяСтрока.ВидРасчетов = Перечисления.ВидыРасчетовПоЗаймам.ОсновнойДолг;
		
		Если ИФОвТабЧасти Тогда
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ПараметрыГрафиков, "ИФО, КФО, КПС, КЭК, ДопКлассификация, КодМероприятия, КодЦели");
		Иначе
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ПараметрыГрафиков, "КФО, КПС, КЭК, ДопКлассификация, КодМероприятия, КодЦели");
		КонецЕсли;
		
		Если ПараметрыГрафиков.Свойство("СчетРасчетов") И ЗначениеЗаполнено(ПараметрыГрафиков.СчетРасчетов) Тогда
			НоваяСтрока.СчетРасчетов = ПараметрыГрафиков.СчетРасчетов;
		ИначеЕсли ЗначениеЗаполнено(НоваяСтрока.КЭК) Тогда
			НоваяСтрока.СчетРасчетов = БухгалтерскийУчет.ПолучитьАналитическийСчетПоКЭК(НоваяСтрока.КЭК, ДопустимыеСчета, ,
				ДокументОбъект.Дата, ДокументОбъект.Организация, ?(ИФОвТабЧасти, НоваяСтрока.ИФО, ДокументОбъект.ИФО));
		КонецЕсли;
		
		// Следующее значение переменной цикла.
		ОчереднойМесяц = ДобавитьМесяц(ОчереднойМесяц, 1);
		
	КонецЦикла;
	
	ОбщегоНазначенияБГУ.РаспределитьСуммуПоКолонкеТаблицы(ПараметрыГрафиков.СуммаПоДоговору, ГрафикПлатежейНовый, "СуммаВВалюте", "БазаРаспределения");
	
	ДокументОбъект.ГрафикПлатежей.Загрузить(ГрафикПлатежейНовый);
	
КонецПроцедуры

Процедура ЗаполнитьГрафикИсполненияПоПараметрам(ДокументОбъект, ПараметрыГрафиков, ДопустимыеСчета) Экспорт
	
	ДокументОбъект.ГрафикИсполнения.Очистить();
	
	МетаданныеДокумента = ДокументОбъект.Ссылка.Метаданные();
	ИФОвТабЧасти = ОбщегоНазначенияБГУ.ЕстьРеквизитТабЧастиДокумента("ИФО", МетаданныеДокумента, "ГрафикИсполнения");
	
	ГрафикИсполненияИсходный = ДокументОбъект.ГрафикИсполнения.Выгрузить();
	ГрафикИсполненияНовый = ГрафикИсполненияИсходный.СкопироватьКолонки();
	ГрафикИсполненияНовый.Колонки.Добавить("БазаРаспределения", Новый ОписаниеТипов("Число"));
	
	ПараметрыПериода = УчетДоходовРасходов.ПараметрыПризнанияДоходовРасходовПоМесяцам(ПараметрыГрафиков.НачалоПериодаНачислений, ПараметрыГрафиков.КонецПериодаНачислений);
	НачисленияВКонцеПериода = (ПараметрыГрафиков.ВариантНачислений = 0);
	
	// Инициализация переменных цикла.
	Если ПараметрыГрафиков.ПериодичностьНачислений = "ПоМесяцам" Тогда // Начало месяца.
		ОчереднойМесяц = НачалоМесяца(ПараметрыГрафиков.НачалоПериодаНачислений);
	ИначеЕсли ПараметрыГрафиков.ПериодичностьНачислений = "ПоКварталам" Тогда // Начало квартала.
		ОчереднойМесяц = НачалоКвартала(ПараметрыГрафиков.НачалоПериодаНачислений);
	ИначеЕсли ПараметрыГрафиков.ПериодичностьНачислений = "ПоПолугодиям" Тогда // Начало полугодия.
		ОчереднойМесяц = ?(Месяц(ПараметрыГрафиков.НачалоПериодаНачислений) <= 6, НачалоГода(ПараметрыГрафиков.НачалоПериодаНачислений),
			Дата(Год(ПараметрыГрафиков.НачалоПериодаНачислений), 7, 1) );
	ИначеЕсли ПараметрыГрафиков.ПериодичностьНачислений = "ПоГодам" Тогда // Начало года.
		ОчереднойМесяц = НачалоГода(ПараметрыГрафиков.НачалоПериодаНачислений);
	Иначе // Раз в месяц, в 3 месяца, в 12 месяцев.
		ОчереднойМесяц = НачалоДня(ПараметрыГрафиков.НачалоПериодаНачислений);
	КонецЕсли;
	СчетчикПоКварталам = 0;
	СчетчикПоПолугодиям = 0;
	СчетчикПоГодам = 0;
	
	// Цикл по месяцам.
	Пока КонецДня(ОчереднойМесяц) <= КонецДня(ПараметрыГрафиков.КонецПериодаНачислений) Цикл
		
		ДоляМесяца = 0;
		Если ПараметрыГрафиков.ПериодичностьНачислений = "ПоМесяцам"
		 ИЛИ ПараметрыГрафиков.ПериодичностьНачислений = "ПоКварталам"
		 ИЛИ ПараметрыГрафиков.ПериодичностьНачислений = "ПоПолугодиям"
		 ИЛИ ПараметрыГрафиков.ПериодичностьНачислений = "ПоГодам" Тогда
			
			НачалоПериода = Макс(ПараметрыГрафиков.НачалоПериодаНачислений, НачалоДня(ОчереднойМесяц));
			КонецПериода = Мин(ПараметрыГрафиков.КонецПериодаНачислений,  НачалоДня(КонецМесяца(ОчереднойМесяц)));
			
			Если КонецПериода < НачалоПериода Тогда
				ДоляМесяца = 0; // Месяц за пределами выбранного периода.
			ИначеЕсли НачалоПериода >= ПараметрыПериода.НачалоПериодаЦелыхМесяцев
				И КонецПериода <= ПараметрыПериода.КонецПериодаЦелыхМесяцев Тогда // Внутри периода целых месяцев.
				ДоляМесяца = 1; // Целый месяц.
			Иначе
				НецелыйМесяц = ПараметрыПериода.НецелыеМесяцы.Найти(НачалоМесяца(ОчереднойМесяц), "Месяц");
				Если НецелыйМесяц = Неопределено Тогда
					ДоляМесяца = 1; // Целый месяц.
				Иначе
					ДоляМесяца = НецелыйМесяц.Вес; // Нецелый месяц.
				КонецЕсли;
			КонецЕсли;
			
		Иначе
			
			НачалоПериода = Макс(ПараметрыГрафиков.НачалоПериодаНачислений, НачалоДня(ОчереднойМесяц));
			КонецПериода = Мин(ПараметрыГрафиков.КонецПериодаНачислений,  ДобавитьМесяц(ОчереднойМесяц, 1));
			ДоляМесяца = 1;
			
		КонецЕсли;
		
		Если ПараметрыГрафиков.ПериодичностьНачислений = "ПоМесяцам"
		 ИЛИ ПараметрыГрафиков.ПериодичностьНачислений = "РазВ1Месяц" Тогда
			
			НоваяСтрока = ГрафикИсполненияНовый.Добавить();
			НоваяСтрока.БазаРаспределения = ДоляМесяца;
			НоваяСтрока.ИсполнитьДо = ?(НачисленияВКонцеПериода, КонецПериода, НачалоПериода);
			
		ИначеЕсли ПараметрыГрафиков.ПериодичностьНачислений = "ПоКварталам"
			ИЛИ   ПараметрыГрафиков.ПериодичностьНачислений = "РазВ3Месяца" Тогда
			
			СчетчикПоКварталам = СчетчикПоКварталам + 1;
			Если СчетчикПоКварталам > 3 Тогда
				СчетчикПоКварталам = 1; // Новый квартал.
			КонецЕсли;
			
			Если СчетчикПоКварталам = 1 Тогда
				НоваяСтрока = ГрафикИсполненияНовый.Добавить();
				НоваяСтрока.БазаРаспределения = ДоляМесяца;
			Иначе
				НоваяСтрока.БазаРаспределения = НоваяСтрока.БазаРаспределения + ДоляМесяца;
			КонецЕсли;
			
			Если Не НачисленияВКонцеПериода И СчетчикПоКварталам = 1 Тогда
				НоваяСтрока.ИсполнитьДо = НачалоПериода;
			ИначеЕсли НачисленияВКонцеПериода Тогда
				НоваяСтрока.ИсполнитьДо = КонецПериода;
			КонецЕсли;
			
		ИначеЕсли ПараметрыГрафиков.ПериодичностьНачислений = "ПоПолугодиям"
			ИЛИ   ПараметрыГрафиков.ПериодичностьНачислений = "РазВ6Месяцев" Тогда
			
			СчетчикПоПолугодиям = СчетчикПоПолугодиям + 1;
			Если СчетчикПоПолугодиям > 6 Тогда
				СчетчикПоПолугодиям = 1; // Новое полугодие.
			КонецЕсли;
			
			Если СчетчикПоПолугодиям = 1 Тогда
				НоваяСтрока = ГрафикИсполненияНовый.Добавить();
				НоваяСтрока.БазаРаспределения = ДоляМесяца;
			Иначе
				НоваяСтрока.БазаРаспределения = НоваяСтрока.БазаРаспределения + ДоляМесяца;
			КонецЕсли;
			
			Если Не НачисленияВКонцеПериода И СчетчикПоПолугодиям = 1 Тогда
				НоваяСтрока.ИсполнитьДо = НачалоПериода;
			ИначеЕсли НачисленияВКонцеПериода Тогда
				НоваяСтрока.ИсполнитьДо = КонецПериода;
			КонецЕсли;
			
		ИначеЕсли ПараметрыГрафиков.ПериодичностьНачислений = "ПоГодам"
			ИЛИ   ПараметрыГрафиков.ПериодичностьНачислений = "РазВ12Месяцев" Тогда
			
			СчетчикПоГодам = СчетчикПоГодам + 1;
			Если СчетчикПоГодам > 12 Тогда
				СчетчикПоГодам = 1; // Новый год.
			КонецЕсли;
			
			Если СчетчикПоГодам = 1 Тогда
				НоваяСтрока = ГрафикИсполненияНовый.Добавить();
				НоваяСтрока.БазаРаспределения = ДоляМесяца;
			Иначе
				НоваяСтрока.БазаРаспределения = НоваяСтрока.БазаРаспределения + ДоляМесяца;
			КонецЕсли;
			
			Если Не НачисленияВКонцеПериода И СчетчикПоГодам = 1 Тогда
				НоваяСтрока.ИсполнитьДо = НачалоПериода;
			ИначеЕсли НачисленияВКонцеПериода Тогда
				НоваяСтрока.ИсполнитьДо = КонецПериода;
			КонецЕсли;
			
		КонецЕсли;
		
		Если ИФОвТабЧасти Тогда
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ПараметрыГрафиков, "ИФО, КФО, КПС, КЭК");
		Иначе
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ПараметрыГрафиков, "КФО, КПС, КЭК");
		КонецЕсли;
		
		Если ПараметрыГрафиков.Свойство("СчетРасчетов") И ЗначениеЗаполнено(ПараметрыГрафиков.СчетРасчетов) Тогда
			НоваяСтрока.СчетРасчетов = ПараметрыГрафиков.СчетРасчетов;
		ИначеЕсли ЗначениеЗаполнено(НоваяСтрока.КЭК) Тогда
			НоваяСтрока.СчетРасчетов = БухгалтерскийУчет.ПолучитьАналитическийСчетПоКЭК(НоваяСтрока.КЭК, ДопустимыеСчета, ,
				ДокументОбъект.Дата, ДокументОбъект.Организация, ?(ИФОвТабЧасти, НоваяСтрока.ИФО, ДокументОбъект.ИФО));
		КонецЕсли;
			
		// Следующее значение переменной цикла.
		ОчереднойМесяц = ДобавитьМесяц(ОчереднойМесяц, 1);
		
	КонецЦикла;
	
	ОбщегоНазначенияБГУ.РаспределитьСуммуПоКолонкеТаблицы(ПараметрыГрафиков.СуммаПоДоговору, ГрафикИсполненияНовый, "СуммаВВалюте", "БазаРаспределения");
	
	ДокументОбъект.ГрафикИсполнения.Загрузить(ГрафикИсполненияНовый);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
